Австралия/src/Catalogs/EarningsCalculationParameters/EarningsCalculationParameters.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>EarningsCalculationParameters</name>
  <attributes>
    <name>SourceName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SourcePresentation</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Query</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomQuery</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SpecifyValueAtPayrollCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>DataFilterPeriods</name>
    <attributes>
      <name>BoundaryDateName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BoundaryDatePresentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PeriodBoundaryType</name>
      <type>
        <types>EnumRef.PeriodBoundaryTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Period</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ShiftPeriod</name>
      <type>
        <types>EnumRef.Periodicity</types>
      </type>
    </attributes>
    <attributes>
      <name>PeriodShift</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Indicators</name>
    <attributes>
      <name>Use</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>QueryParameters</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ComparisonType</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/AccumulationRegisters/Sales/Sales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Sales</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VATAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Cost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VATAmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>SalesTaxAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>SalesTaxAmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>OfflineRecord</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ZeroInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>CatalogRef.ProductsBatches</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ownership</name>
    <type>
      <types>CatalogRef.InventoryOwnership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.RegistersCorrection</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.AccountSalesFromConsignee</types>
      <types>DocumentRef.InventoryTransfer</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.SalesSlip</types>
      <types>DocumentRef.ExpenseReport</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorInvoiceIssued</types>
      <types>DocumentRef.ShiftClosure</types>
      <types>DocumentRef.AccountSalesToConsignor</types>
      <types>DocumentRef.GoodsIssue</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SalesRep</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BundleProduct</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BundleCharacteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DeliveryStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>DeliveryEndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Enums/ExchangeRateMethods/ExchangeRateMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ExchangeRateMethods</name>
  <enumValues>
    <name>Multiplier</name>
  </enumValues>
  <enumValues>
    <name>Divisor</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/EarningsCalculationParameters/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	
	NativeLanguagesSupportServer.ChoiceDataGetProcessing(
		ChoiceData,
		Parameters,
		StandardProcessing,
		Metadata.Catalogs.EarningsCalculationParameters);
	
EndProcedure

Procedure PresentationGetProcessing(Data, Presentation, StandardProcessing)
	
	NationalLanguageSupportClientServer.PresentationGetProcessing(Data, Presentation, StandardProcessing);
	
EndProcedure

Procedure PresentationFieldsGetProcessing(Fields, StandardProcessing)
	
	NationalLanguageSupportClientServer.PresentationFieldsGetProcessing(Fields, StandardProcessing);
	
EndProcedure

#EndRegion

#Region InfobaseUpdate

Procedure ChangeSalesAmountForResponsibleParameter() Export
	
	OldQueryText =
	"SELECT
	|	SUM(ISNULL(Sales.Amount * &AccountingCurrencyExchangeRate * &DocumentCurrencyMultiplicity / (&DocumentCurrencyRate * &AccountingCurrecyFrequency), 0)) AS SalesAmount
	|FROM
	|	AccumulationRegister.Sales AS Sales
	|WHERE
	|	Sales.Amount >= 0
	|	AND Sales.Period BETWEEN BEGINOFPERIOD(&RegistrationPeriod, MONTH) AND ENDOFPERIOD(&RegistrationPeriod, MONTH)
	|	AND Sales.Company = &Company
	|	AND Sales.Department = &Department
	|	AND Sales.Document.Responsible = &Employee
	|	AND (CAST(Sales.Recorder AS Document.SalesOrder) REFS Document.SalesOrder
	|			OR CAST(Sales.Recorder AS Document.ShiftClosure) REFS Document.ShiftClosure
	|			OR CAST(Sales.Recorder AS Document.SalesInvoice) REFS Document.SalesInvoice
	|			OR CAST(Sales.Recorder AS Document.SalesSlip) REFS Document.SalesSlip)
	|
	|GROUP BY
	|	Sales.Document.Responsible";
	
	Parameter = Catalogs.EarningsCalculationParameters.FindByAttribute("ID", "SalesAmountForResponsible");
	If ValueIsFilled(Parameter)
		And StrCompare(StrReplace(Parameter.Query, Chars.CR, ""), OldQueryText) = 0 Then
		
		ParameterObject = Parameter.GetObject();
		ParameterObject.ID = "SalesAmountByResponsible";
		ParameterObject.Query =
		"SELECT
		|	SUM(CASE
		|			WHEN Companies.ExchangeRateMethod = VALUE(Enum.ExchangeRateMethods.Multiplier)
		|				THEN ISNULL(Sales.Amount * &DocumentCurrencyMultiplicity / &DocumentCurrencyRate, 0)
		|			ELSE ISNULL(Sales.Amount * &DocumentCurrencyRate / &DocumentCurrencyMultiplicity, 0)
		|		END) AS SalesAmount
		|FROM
		|	AccumulationRegister.Sales AS Sales
		|		INNER JOIN Catalog.Companies AS Companies
		|		ON Sales.Company = Companies.Ref
		|WHERE
		|	Sales.Amount >= 0
		|	AND Sales.Period BETWEEN BEGINOFPERIOD(&RegistrationPeriod, MONTH) AND ENDOFPERIOD(&RegistrationPeriod, MONTH)
		|	AND Sales.Company = &Company
		|	AND Sales.Department = &Department
		|	AND Sales.Document.Responsible = &Employee
		|	AND (Sales.Recorder REFS Document.ShiftClosure
		|			OR Sales.Recorder REFS Document.SalesInvoice
		|			OR Sales.Recorder REFS Document.SalesSlip)
		|
		|GROUP BY
		|	Sales.Document.Responsible";
		
		TabRow = ParameterObject.QueryParameters.Find("AccountingCurrencyExchangeRate", "Name");
		If TabRow <> Undefined Then
			ParameterObject.QueryParameters.Delete(TabRow);
		EndIf;
		
		TabRow = ParameterObject.QueryParameters.Find("AccountingCurrecyFrequency", "Name");
		If TabRow <> Undefined Then
			ParameterObject.QueryParameters.Delete(TabRow);
		EndIf;
		
		BeginTransaction();
		
		Try
			
			InfobaseUpdate.WriteObject(ParameterObject);
			
			CommitTransaction();
			
		Except
			
			RollbackTransaction();
			
			ErrorDescription = StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = 'Cannot write catalog ""%1"". Details: %2'; ru = 'Не удалось записать справочник ""%1"". Подробнее: %2';pl = 'Nie można zapisać katalogu ""%1"". Szczegóły: %2';es_ES = 'No se ha podido guardar el catálogo ""%1"". Detalles: %2';es_CO = 'No se ha podido guardar el catálogo ""%1"". Detalles: %2';tr = '""%1"" kataloğu kaydedilemiyor. Ayrıntılar: %2';it = 'Impossibile scrivere l''anagrafica ""%1"". Dettagli: %2';de = 'Fehler beim Speichern des Katalogs ""%1"". Details: %2'", CommonClientServer.DefaultLanguageCode),
				Parameter,
				BriefErrorDescription(ErrorInfo()));
			
			WriteLogEvent(
				InfobaseUpdate.EventLogEvent(),
				EventLogLevel.Error,
				Metadata.Catalogs.EarningsCalculationParameters,
				,
				ErrorDescription);
			
		EndTry;
		
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
